<?php

return [
    'plural' => 'نموذج',
    'singular' => 'نموذج',
    'empty' => 'لا توجد نماذج',
    'permission' => 'ادارة النماذج',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'list' => 'كل العملاء',
        'show' => 'عرض',
        'create' => 'إضافة',
        'new' => 'إضافة',
        'edit' => 'تعديل  ',
        'delete' => 'حذف ',
        'restore' => 'استعادة',
        'forceDelete' => 'حذف نهائي',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة نموذج بنجاح .',
        'updated' => 'تم تعديل نموذج بنجاح .',
        'deleted' => 'تم حذف نموذج بنجاح .',
        'restored' => 'تم استعادة نموذج بنجاح .',
    ],
    'attributes' => [
        'name' => 'اسم النموذج',
    
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا النموذج ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد استعادة هذا النموذج ؟',
            'confirm' => 'استعادة',
            'cancel' => 'إلغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا العميل النموذج؟',
            'confirm' => 'حذف نهائي',
            'cancel' => 'إلغاء',
        ],
    ],
];
